---
kind: property
id: P:Autodesk.Revit.DB.AssemblyDifferenceNamingCategory.NamingCategoryId2
source: html/15c03cc2-ed08-eea4-498f-8f1e0ce5d7de.htm
---
# Autodesk.Revit.DB.AssemblyDifferenceNamingCategory.NamingCategoryId2 Property

Naming category id of the second assembly

## Syntax (C#)
```csharp
public ElementId NamingCategoryId2 { get; }
```